---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerKFactorParam
source: html/61d6dc2d-19ef-ffc8-4471-9bde83cc616d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsFpSprinklerKFactorParam Property

"K-Factor"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsFpSprinklerKFactorParam { get; }
```